Revit 2027 API
ReferencePoint.SetPointElementReference Method
Change the rule for computing the location of the ReferencePoint relative to other elements in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPointElementReference(
	PointElementReference pointElementReference
)
Public Sub SetPointElementReference (
	pointElementReference As PointElementReference
)
public:
void SetPointElementReference(
	PointElementReference^ pointElementReference
)
member SetPointElementReference :
        pointElementReference : PointElementReference -> unit
Parameters
pointElementReference PointElementReference
An object specifying a rule for the location and orientation of a ReferencePoint. (Note: The ReferencePoint object does not store the pointElementReference object after this call.)
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when Reference is set to a non-null object, and the ReferencePoint is unable to move to the new reference.
Remarks
pointElementReference may be null, in which case the ReferencePoint does not follow any other element. When Reference is changed from null to a non-null value, the point moves and rotates to the prescribed location and orientation. Where the coordinate system has some freedom, it will remain as close to the old orientation as possible. When the reference is set to null, the point does not move or rotate.
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace